{
  "intro_success": {
    "title": "Study Successful",
    "image": "textbookIcon.png",
    "description": "You managed to focus for a few hours. The material is dry, but you feel a sense of accomplishment. You found a receipt in the textbook."
  },
  "intro_fail": {
    "title": "Distracted",
    "image": "person1.png",
    "description": "You tried to study, but without the textbook, you just stared at the wall. Your anxiety grows."
  },
  "coffee_break": {
    "title": "Caffeinated",
    "image": "coffee.png",
    "description": "The bitter liquid warms your soul. You feel ready to take on the world, or at least one more hour of calculus."
  },
  "art_therapy": {
    "title": "Art Therapy",
    "image": "paintingIcon.png",
    "description": "You paint your feelings. It's messy, but it helps clear your mind."
  },
  "art_practice": {
    "title": "Studio Time",
    "image": "person2.png",
    "description": "You work on your technique. You produced some decent sketches. A new opportunity for your hobby has opened up."
  },
  "board_decay": {
    "title": "Overwhelmed",
    "image": "cashIcon.png",
    "description": "The task was left unattended for too long. It weighs on your mind, draining your mental state."
  },
  "study_note": {
    "title": "Suspicious Note Found",
    "image": "noteIcon.png",
    "description": "While studying, you find a cryptic note tucked between pages of your textbook. It mentions strange occurrences around campus buildings."
  },
  "shovel_success": {
    "title": "Hard Work Pays Off",
    "image": "shovelIcon.png",
    "description": "You finish shoveling snow from the campus pathways. Your roommate walks by, thanks you awkwardly, and hands you some cash from the work program. They seem nervous and wet, like they've just come from somewhere damp. You file the observation away."
  },
  "shovel_fail": {
    "title": "Slipped and Fell",
    "image": "footprints.png",
    "description": "You neglected to shovel the snow in time. Walking to class, you slipped on ice and bruised your ego (and your tailbone)."
  },
  "lecture_success": {
    "title": "Met a Classmate",
    "image": "lecutreIcon.png",
    "description": "During the lecture, you strike up a conversation with another student. They mention they've heard strange rumors about flooding and water damage in Mordridge Hall, one of the oldest buildings on campus. 'Something weird is definitely going on there,' they say nervously."
  },
  "roommate_store": {
    "title": "Roommate's Stash",
    "image": "roommate.png",
    "description": "Your roommate has a surprising collection of energy drinks and coffee. You trade some cash for a caffeine boost."
  },
  "rumor_map": {
    "title": "The Secret Below",
    "image": "rumorIcon.png",
    "description": "The rumors about a hidden basement laboratory in Mordridge Hall become clearer. The classmate and group partner both mention the same thing: there's a restricted area beneath Mordridge that nobody talks about. You sketch out a map showing where it might be."
  },
  "flooding_map": {
    "title": "The Mordridge Connection",
    "image": "floodingIcon.png",
    "description": "Your group partner shares troubling news: there have been repeated flooding incidents specifically in Mordridge Hall's lower levels. The pattern is too deliberate to be natural. Someone—or something—is causing this. This is the key evidence you need."
  },
  "mystery_stakes": {
    "title": "The Prize",
    "image": "floodingIcon.png",
    "description": "You overhear administrators discussing the Mordridge situation in panic. Nobody can figure out what's causing the flooding, and they're desperate for answers. They've made an unusual offer: anyone who can identify and prove who or what is behind the incidents gets a full A in all their classes. This mystery just became your top priority."
  },
  "map_footprints": {
    "title": "Wet Tracks in Mordridge",
    "image": "footprints.png",
    "description": "You explore Mordridge Hall's basement with your map in hand. Your heart races when you spot them: strange, wet footprints leading away from the lower levels. They're large and oddly shaped—definitely not a normal student's tracks."
  },
  "footprints_door": {
    "title": "The Hidden Laboratory",
    "image": "key.png",
    "description": "The footprints lead directly to a concealed door in Mordridge's basement wall. It's clearly been used recently—water still drips from the frame. The door is locked, but now you know exactly where the water is coming from: some kind of secret lab!"
  },
  "door_lab": {
    "title": "The Wereshark Experiment",
    "image": "lab.png",
    "description": "The key opens the hidden door. Your worst fears are confirmed: inside is an underground experimental laboratory, filled with aquariums containing bizarre aquatic creatures. One tank has a nameplate that reads: 'EXPERIMENT SUBJECT - [Your Roommate's Name].' They're the subject, not the researcher."
  },
  "wereshark_lab": {
    "title": "The Final Piece",
    "image": "lab.png",
    "description": "You uncover detailed research files in the lab. The transformation was incomplete—your roommate escaped the experiments months ago, but they're still transforming. They've been hiding in Mordridge's basement ever since, trying desperately to destroy the lab and erase evidence. The flooding incidents were their failed attempts to destroy it all. Now you have everything you need for an accusation."
  },
  "accuse_correct": {
    "title": "CASE SOLVED!",
    "image": "wereshark.png",
    "description": "You confront your roommate with the evidence. They confess - the wereshark experiments transformed them, and the flooding was their failed attempts to destroy the lab. The authorities take them away. You've solved the mystery!"
  },
  "accuse_wrong": {
    "title": "False Accusation",
    "image": "gaurdIcon.png",
    "description": "You accused the wrong person! They're furious and everyone thinks you're losing your mind. Your sanity takes a massive hit from the embarrassment and doubt."
  },
  "study_success": {
    "title": "CS559 Study Session Complete",
    "image": "studyIcon.png",
    "description": "You complete your study session with the textbook. As you pack up, you notice a strange note tucked inside—something about unusual activity at Mordridge Hall. You also spot a flyer for an upcoming campus lecture on emerging research projects."
  },
  "guard_key": {
    "title": "Access Granted",
    "image": "gaurdIcon.png",
    "description": "You slip the guard some cash. They look around nervously before handing you a worn brass key. 'This opens maintenance areas in Mordridge Hall,' they whisper. 'But I never gave it to you. And watch yourself down there—something feels wrong about that building.'"
  },
  "guard_rumor_fail": {
    "title": "Unprofessional Conduct",
    "image": "gaurdIcon.png",
    "description": "The guard glares at you as you try to share campus rumors with college faculty. 'I'm not interested in gossip, student. This is highly unprofessional.' You feel embarrassed and your reputation takes a hit."
  }
}
